Revit 2026 API

# Application Properties

---

The Application type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |

#### Reference

Application Class

Autodesk.Revit.Creation Namespace